[
    {
        "book_id": 1,
        "title": "Kiswahili Mufti",
        "author": "Wallah Bin Wallah",
        "synopsis": "",
        "available": true,
        "borrower_id": null,
        "due_date": null
    },
    {
        "book_id": "B001",
        "title": "Art of War",
        "author": "Sun Tzu",
        "synopsis": "The Art of War by Sun Tzu is a classic Chinese military treatise written over 2,500 years ago. It presents timeless principles of strategy, leadership, and warfare, emphasizing intelligence, preparation, and adaptability over brute force. Divided into 13 chapters, each focuses on a specific aspect of conflict—such as planning, deception, terrain, and troop management.",
        "available": true,
        "borrower_id": null,
        "due_date": null
    },
    {
        "book_id": "B002",
        "title": "My Life in Crime",
        "author": "John Kiriamiti",
        "synopsis": "My Life in Crime is a gripping autobiographical novel by John Kiriamiti that recounts his life as a notorious criminal in Kenya during the 1960s and 70s. Told through the eyes of the protagonist, Jack Zollo—a fictional version of the author—the story follows his descent from an ambitious youth into a life of theft, bank robberies, and deceit. Set against the backdrop of Nairobi’s underworld, the novel captures the thrill and danger of criminal life, as well as the emotional toll it takes on his relationships, particularly with his girlfriend, Milly. Eventually, Zollo is arrested, leading to introspection and a desire for redemption. A fast-paced and raw narrative, the book offers a unique insider perspective into crime, punishment, and the struggle for personal change.",
        "available": true,
        "borrower_id": null,
        "due_date": null
    },
    {
        "book_id": "B003",
        "title": "Pimp: The Story of my life",
        "author": "Iceberg Slim",
        "synopsis": "Pimp: The Story of My Life is the brutally honest, autobiographical account of Iceberg Slim (born Robert Beck), one of America’s most infamous pimps. Set in the gritty streets of Chicago and other urban centers during the 1930s–1950s, the book delves deep into the underground world of prostitution, manipulation, and survival.\n\nWith unflinching detail, Slim chronicles his rise in the pimping game—learning the psychology of control, perfecting the art of the con, and navigating a violent, exploitative lifestyle built on power and paranoia. From cold-hearted hustler to eventual self-reckoning, Slim takes readers through cycles of betrayal, addiction, incarceration, and fleeting success.\n\nMore than just a street memoir, Pimp is a dark, poetic exploration of masculinity, racism, exploitation, and redemption. It exposes the raw underside of the American dream and remains a powerful, influential work that shaped hip-hop culture and urban literature for decades to come.",
        "available": false,
        "borrower_id": "M003",
        "due_date": "2025-08-11"
    },
    {
        "book_id": "B004",
        "title": "Chozi La Heri",
        "author": "Asumpta",
        "synopsis": "No known synopsis",
        "available": true,
        "borrower_id": null,
        "due_date": null
    }
]